blog/app/controllers/posts_controller.rb

  def index
	@posts = Post.order('created_at DESC').page(params[:page]).per_page(4)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "posts"